#e digitDP    
n = int(input())
k = int(input())
s=str(n)
l=len(s)

dp = [[[0]*(3+1) for _ in range(2)] for _ in range(l) ]
#dp[i桁目][0=未満確定、1=不確定][0以外の数字の数]
x = int(s[0])
#未満確定、1以上0個 =0
dp[0][0][0] = 1
#未満確定、1以上1個 = 1 ~ x-1
dp[0][0][1] = x-1
#head、1以上0個
dp[0][1][0] = 0
#head、1以上1個 = x
dp[0][1][1] = 1


for i in range(1,l):
    x = int(s[i])
    if x>=1:
        #headじゃない、1以上０こ(0, )
        dp[i][0][0] = dp[i-1][0][0]*1 +dp[i-1][1][0]*1
        #head 1以上0個()
        dp[i][1][0] = dp[i-1][0][0]*0 +dp[i-1][1][0]*0
        for j in [1,2,3]:
            dp[i][0][j] = dp[i-1][0][j-1]*9 +dp[i-1][1][j-1]*(x-1) +dp[i-1][0][j]*1 +dp[i-1][1][j]*1
            dp[i][1][j] = dp[i-1][0][j-1]*0 +dp[i-1][1][j-1]*1     +dp[i-1][0][j]*0 +dp[i-1][1][j]*0
    else:
        #headじゃない、1以上が０こ(0, )
        dp[i][0][0] = dp[i-1][0][0]*1 +dp[i-1][1][0]*0
        #head 1以上0個
        dp[i][1][0] = dp[i-1][0][0]*0 +dp[i-1][1][0]*1
        for j in [1,2,3]:
            dp[i][0][j] = dp[i-1][0][j-1]*9 +dp[i-1][1][j-1]*0 +dp[i-1][0][j]*1 +dp[i-1][1][j]*0
            dp[i][1][j] = dp[i-1][0][j-1]*0 +dp[i-1][1][j-1]*0 +dp[i-1][0][j]*0 +dp[i-1][1][j]*1
            
print(dp[-1][0][k] + dp[-1][1][k])