n = int(input())
k = int(input())
l = len(str(n))
a = [int(str(n)[i]) for i in range(l)]

dp = [[[0, 0] for _ in range(k + 1)] for _ in range(l)] #dp[i桁目][0でないのがj個][0: 未満, 1: 未満不確定]

dp[0][0][0] = 1         #0桁目で0でないのが0個、未満確定は0が入る1個
dp[0][0][1] = 0         #0桁目で0でないのが0個、未満不確定はa[0]!=0より0個
dp[0][1][0] = a[0] - 1  #0桁目で0でないのが1個、未満確定は1-a[0]-1のa[0]-1個
dp[0][1][1] = 1         #0桁目で0でないのが1個、未満不確定はa[0]の1個

#print(a)

for i in range(1, l):
    for j in range(k + 1):
        if j > 0 and a[i] != 0:
            #未満確定で0以外がj個のとき、0の1個
            #未満確定で0以外がj-1個のとき、1-9の9個
            #未満不確定で0以外がj個のとき、0の1個
            #未満不確定で0以外がj-1個のとき、1-a[i]-1のa[i]-1個
            dp[i][j][0] = dp[i-1][j][0] * 1 \
                        + dp[i-1][j-1][0] * 9 \
                        + dp[i-1][j][1] * 1 \
                        + dp[i-1][j-1][1] * (a[i] - 1)
            #未満不確定で0以外がj-1個のとき、a[i]の1個
            dp[i][j][1] = dp[i-1][j-1][1] * 1

        elif j > 0 and a[i] == 0:
            #未満確定で0以外がj個のとき、0の1個
            #未満確定で0以外がj-1個のとき、1-9の9個
            dp[i][j][0] = dp[i-1][j][0] * 1 \
                        + dp[i-1][j-1][0] * 9
            #未満確定で0以外がj個のとき、0の1個
            dp[i][j][1] = dp[i-1][j][1] * 1
        
        elif j == 0 and a[i] != 0:
            #未満確定で0以外がj個のとき、0の1個
            #未満不確定で0以外がj個のとき、0の1個
            dp[i][j][0] = dp[i-1][j][0] * 1 \
                        + dp[i-1][j][1] * 1
            #a[i] == 0のとき未満不確定はありえない
            dp[i][j][1] = 0
        elif j == 0 and a[i] == 0:
            #未満確定で0以外がj個のとき、0の1個
            dp[i][j][0] = dp[i-1][j][0] * 1
            #未満不確定で0以外がj個のとき、0==a[i]の1個
            dp[i][j][1] = dp[i-1][j][1] * 1
            

#print(dp)
print(dp[l-1][k][0] + dp[l-1][k][1])